index.org
* Emaces Usful Command
** Command
*** 常用命令
 #+BEGIN_SRC 
  cmd --insecure 模式打开emacs才能有网络连接
  cmd --insecure 用Texlive GUI command-line打开emacs之后默认用texlive编译.tex
  c-x c-s 保存当前文件
  m-x list-package 列出所有package
  c-x o 切换窗口
  m-> 文档底部
  m-< 文档开头
  c-v 上滚屏
  m-v 下滚屏
  c-x c-b 列出所有缓冲区/没什么用 直接用打开文件就行了
  c-x h 全选
  c-space 标记
  c-@     标记
  c-/ 撤销命令
  c-_ 撤销命令
  M-m 打开spacemacs主菜单
  M-m TAB一键循环切换buffer
  c-e M-b 先切换到行尾 然后按句子单位回退
  M-e M-a 换行 到指定位置 最好用的命令
 #+END_SRC
*** 命令主菜单
#+BEGIN_SRC 
M-m spacemacs buffer管理
M-x helm-command
c-c 当前文档格式 编译菜单
c-x 文档保存 新建等管理
c-h 帮助
#+END_SRC
*** 帮助
 #+BEGIN_SRC 
    c-h 主命令
    c-h a 查找关键词对应的函数
    c-h f 函数
    c-h v 变量
    c-h k 快捷键
 #+END_SRC
** Spacemacs
*** Spacemacs 配置文件 添加package cuda-mode
 添加该段代码到.spacemacs.el文件中的合适位置
 #+BEGIN_SRC 
 ;; add packages 
 ;;
 (defun dotspacemacs/layers ()
   "Configuration Layers declaration."
   (setq-default
    ;; ...
    ;; List of additional packages that will be installed wihout being
    ;; wrapped in a layer. If you need some configuration for these
    ;; packages then consider to create a layer, you can also put the
    ;; configuration in `dotspacemacs/config'.
    ;; add packages
    dotspacemacs-additional-packages '(
                                       cuda-mode
                                       company
                                       )
    ;; ...
    ))

 (defun dotspacemacs/config ()
   "Configuration function.
 This function is called at the very end of Spacemacs initialization after
 layers configuration."
   ;; add packages
   dotspacemacs-additional-packages '(
                                      cuda-mode
                                      company
                                      )
   ;; 
   )
 #+END_SRC
*** Spacemacs 配置文件 初始化init.el文件 使所有buffer默认打开company模式
 #+BEGIN_SRC
 ;; Enable global company mode
 (require 'company)
 (add-hook 'after-init-hook 'global-company-mode)
 (setq company-idle-delay 0.1)
 (setq company-minimum-prefix-length 1)
 (setq company-backends '((company-capf company-files company-elisp company-inf-ruby company-anaconda company-go company-irony company-clang company-cmake company-css company-yasnippet) (company-dabbrev company-dabbrev-code)))
 #+END_SRC
** Company 自动补全包 命令集
#+BEGIN_SRC 
M-n M-p select
Enter: to complete 
C-s, C-r and C-o: Search through the completions with 
M-(digit) to quickly complete with one of the first 10 candidates.
#+END_SRC
* Latex 编辑命令
** 中文环境包
#+BEGIN_SRC 
   % 中文支持包
   \usepackage{ctex}
   \usepackage{CJK}

    % 调用环境变量 
    \begin{CJK}{UTF8}{song}
    some content here.
    具体内容
    \end{CJK}
#+END_SRC
* Org mode 
** Useful Command
*** 编译 
#+BEGIN_SRC 
c-c c-e 编译生成html网站格式
c-c c-e 可选生成latex pdf
#+END_SRC
*** 标题
 #+BEGIN_SRC 
 TAB 切换标题
 s-TAB 切换标题
 m-left/right 升降级标题
 m-enter 插入一个同级标题
 #+END_SRC
*** 块标签
#+BEGIN_SRC 
 <s TAB 快速插入一个 源代码块标签
 <e TAB 快速插入一个 example块标签
 s    #+begin_src ... #+end_src   
 e    #+begin_example ... #+end_example  : 单行的例子以冒号开头  
 q    #+begin_quote ... #+end_quote      通常用于引用，与默认格式相比左右都会留出缩进  
 v    #+begin_verse ... #+end_verse      默认内容不换行，需要留出空行才能换行  
 c    #+begin_center ... #+end_center   
 l    #+begin_latex ... #+end_latex   
 L    #+latex:   
 h    #+begin_html ... #+end_html   
 H    #+html:   
 a    #+begin_ascii ... #+end_ascii   
 A    #+ascii:   
 i    #+index: line   
 I    #+include: line 
#+END_SRC
*** 排版段落格式
 - 单纯文字编辑 空一行即可
 - 可以用- 来表示要点提示的项目符号
 - 可以用上述块标签来表示源代码等
