index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-04-19 周四 21:40 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orge4005ea">1. Emaces Usful Command</a>
<ul>
<li><a href="#org01266bf">1.1. Command</a>
<ul>
<li><a href="#org79264bc">1.1.1. 常用命令</a></li>
<li><a href="#orge9b1668">1.1.2. 命令主菜单</a></li>
<li><a href="#org50f6a4f">1.1.3. 帮助</a></li>
</ul>
</li>
<li><a href="#org59c1877">1.2. Spacemacs</a>
<ul>
<li><a href="#orgb18656d">1.2.1. Spacemacs 配置文件 添加package cuda-mode</a></li>
<li><a href="#org91549a9">1.2.2. Spacemacs 配置文件 初始化init.el文件 使所有buffer默认打开company模式</a></li>
</ul>
</li>
<li><a href="#org618d69b">1.3. Company 自动补全包 命令集</a></li>
</ul>
</li>
<li><a href="#orga8a6410">2. Latex 编辑命令</a>
<ul>
<li><a href="#org9218477">2.1. 中文环境包</a></li>
</ul>
</li>
<li><a href="#org9dedd5b">3. Org mode</a>
<ul>
<li><a href="#org9b2ba75">3.1. Useful Command</a>
<ul>
<li><a href="#org758793e">3.1.1. 编译</a></li>
<li><a href="#orgfc26fce">3.1.2. 标题</a></li>
<li><a href="#org210ced4">3.1.3. 块标签</a></li>
<li><a href="#org9ffabc5">3.1.4. 排版段落格式</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<p>
&lt;!DOCTYPE html&gt;
&lt;html&gt;
&lt;body&gt;
&lt;h1&gt;Hello World&lt;/h1&gt;
&lt;p&gt;I'm hosted with GitHub Pages.&lt;/p&gt;
&lt;/body&gt;
&lt;/html&gt;
</p>
<div id="outline-container-orge4005ea" class="outline-2">
<h2 id="orge4005ea"><span class="section-number-2">1</span> Emaces Usful Command</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org01266bf" class="outline-3">
<h3 id="org01266bf"><span class="section-number-3">1.1</span> Command</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-org79264bc" class="outline-4">
<h4 id="org79264bc"><span class="section-number-4">1.1.1</span> 常用命令</h4>
<div class="outline-text-4" id="text-1-1-1">
<pre class="example">
cmd --insecure 模式打开emacs才能有网络连接
cmd --insecure 用Texlive GUI command-line打开emacs之后默认用texlive编译.tex
c-x c-s 保存当前文件
m-x list-package 列出所有package
c-x o 切换窗口
m-&gt; 文档底部
m-&lt; 文档开头
c-v 上滚屏
m-v 下滚屏
c-x c-b 列出所有缓冲区/没什么用 直接用打开文件就行了
c-x h 全选
c-space 标记
c-@     标记
c-/ 撤销命令
c-_ 撤销命令
M-m 打开spacemacs主菜单
M-m TAB一键循环切换buffer
c-e M-b 先切换到行尾 然后按句子单位回退
M-e M-a 换行 到指定位置 最好用的命令
</pre>
</div>
</div>
<div id="outline-container-orge9b1668" class="outline-4">
<h4 id="orge9b1668"><span class="section-number-4">1.1.2</span> 命令主菜单</h4>
<div class="outline-text-4" id="text-1-1-2">
<pre class="example">
M-m spacemacs buffer管理
M-x helm-command
c-c 当前文档格式 编译菜单
c-x 文档保存 新建等管理
c-h 帮助
</pre>
</div>
</div>
<div id="outline-container-org50f6a4f" class="outline-4">
<h4 id="org50f6a4f"><span class="section-number-4">1.1.3</span> 帮助</h4>
<div class="outline-text-4" id="text-1-1-3">
<pre class="example">
c-h 主命令
c-h a 查找关键词对应的函数
c-h f 函数
c-h v 变量
c-h k 快捷键
</pre>
</div>
</div>
</div>
<div id="outline-container-org59c1877" class="outline-3">
<h3 id="org59c1877"><span class="section-number-3">1.2</span> Spacemacs</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-orgb18656d" class="outline-4">
<h4 id="orgb18656d"><span class="section-number-4">1.2.1</span> Spacemacs 配置文件 添加package cuda-mode</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
添加该段代码到.spacemacs.el文件中的合适位置
</p>
<pre class="example">
;; add packages 
;;
(defun dotspacemacs/layers ()
  "Configuration Layers declaration."
  (setq-default
   ;; ...
   ;; List of additional packages that will be installed wihout being
   ;; wrapped in a layer. If you need some configuration for these
   ;; packages then consider to create a layer, you can also put the
   ;; configuration in `dotspacemacs/config'.
   ;; add packages
   dotspacemacs-additional-packages '(
                                      cuda-mode
                                      company
                                      )
   ;; ...
   ))

(defun dotspacemacs/config ()
  "Configuration function.
This function is called at the very end of Spacemacs initialization after
layers configuration."
  ;; add packages
  dotspacemacs-additional-packages '(
                                     cuda-mode
                                     company
                                     )
  ;; 
  )
</pre>
</div>
</div>
<div id="outline-container-org91549a9" class="outline-4">
<h4 id="org91549a9"><span class="section-number-4">1.2.2</span> Spacemacs 配置文件 初始化init.el文件 使所有buffer默认打开company模式</h4>
<div class="outline-text-4" id="text-1-2-2">
<pre class="example">
;; Enable global company mode
(require 'company)
(add-hook 'after-init-hook 'global-company-mode)
(setq company-idle-delay 0.1)
(setq company-minimum-prefix-length 1)
(setq company-backends '((company-capf company-files company-elisp company-inf-ruby company-anaconda company-go company-irony company-clang company-cmake company-css company-yasnippet) (company-dabbrev company-dabbrev-code)))
</pre>
</div>
</div>
</div>
<div id="outline-container-org618d69b" class="outline-3">
<h3 id="org618d69b"><span class="section-number-3">1.3</span> Company 自动补全包 命令集</h3>
<div class="outline-text-3" id="text-1-3">
<pre class="example">
M-n M-p select
Enter: to complete 
C-s, C-r and C-o: Search through the completions with 
M-(digit) to quickly complete with one of the first 10 candidates.
</pre>
</div>
</div>
</div>
<div id="outline-container-orga8a6410" class="outline-2">
<h2 id="orga8a6410"><span class="section-number-2">2</span> Latex 编辑命令</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org9218477" class="outline-3">
<h3 id="org9218477"><span class="section-number-3">2.1</span> 中文环境包</h3>
<div class="outline-text-3" id="text-2-1">
<pre class="example">
% 中文支持包
\usepackage{ctex}
\usepackage{CJK}

 % 调用环境变量 
 \begin{CJK}{UTF8}{song}
 some content here.
 具体内容
 \end{CJK}
</pre>
</div>
</div>
</div>
<div id="outline-container-org9dedd5b" class="outline-2">
<h2 id="org9dedd5b"><span class="section-number-2">3</span> Org mode</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org9b2ba75" class="outline-3">
<h3 id="org9b2ba75"><span class="section-number-3">3.1</span> Useful Command</h3>
<div class="outline-text-3" id="text-3-1">
</div>
<div id="outline-container-org758793e" class="outline-4">
<h4 id="org758793e"><span class="section-number-4">3.1.1</span> 编译</h4>
<div class="outline-text-4" id="text-3-1-1">
<pre class="example">
c-c c-e 编译生成html网站格式
c-c c-e 可选生成latex pdf
</pre>
</div>
</div>
<div id="outline-container-orgfc26fce" class="outline-4">
<h4 id="orgfc26fce"><span class="section-number-4">3.1.2</span> 标题</h4>
<div class="outline-text-4" id="text-3-1-2">
<pre class="example">
TAB 切换标题
s-TAB 切换标题
m-left/right 升降级标题
m-enter 插入一个同级标题
</pre>
</div>
</div>
<div id="outline-container-org210ced4" class="outline-4">
<h4 id="org210ced4"><span class="section-number-4">3.1.3</span> 块标签</h4>
<div class="outline-text-4" id="text-3-1-3">
<pre class="example">
&lt;s TAB 快速插入一个 源代码块标签
&lt;e TAB 快速插入一个 example块标签
s    #+begin_src ... #+end_src   
e    #+begin_example ... #+end_example  : 单行的例子以冒号开头  
q    #+begin_quote ... #+end_quote      通常用于引用，与默认格式相比左右都会留出缩进  
v    #+begin_verse ... #+end_verse      默认内容不换行，需要留出空行才能换行  
c    #+begin_center ... #+end_center   
l    #+begin_latex ... #+end_latex   
L    #+latex:   
h    #+begin_html ... #+end_html   
H    #+html:   
a    #+begin_ascii ... #+end_ascii   
A    #+ascii:   
i    #+index: line   
I    #+include: line 
</pre>
</div>
</div>
<div id="outline-container-org9ffabc5" class="outline-4">
<h4 id="org9ffabc5"><span class="section-number-4">3.1.4</span> 排版段落格式</h4>
<div class="outline-text-4" id="text-3-1-4">
<ul class="org-ul">
<li>单纯文字编辑 空一行即可</li>
<li>可以用- 来表示要点提示的项目符号</li>
<li>可以用上述块标签来表示源代码等</li>
</ul>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2018-04-19 周四 21:40</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>